routes/web.php

select * from "log_auditorias" order by "id" desc limit 100
---

    // ==========================================
    // 4. RUTAS SUPER ADMIN
    // ==========================================
    Route::get('/api/logs', function () {
        if (Auth::user()->rol !== 'Administrador') {
            return response()->json(['error' => 'Acceso denegado. Solo administradores.'], 403);
        }
        return response()->json(LogAuditoria::orderBy('id', 'desc')->limit(100)->get());
    });