app/Http/Controllers/AuthController.php

select * from "users" where "usuario" = 'admin' and "activo" = 1 limit 1
---
    public function login(Request $request)
    {
        $usuario = $request->input('usuario');
        $password = $request->input('password');

        if (!$usuario || !$password) {
            return response()->json(['ok' => false, 'mensaje' => 'Ingrese credenciales'], 400);
        }

        $user = User::where('usuario', $usuario)->where('activo', true)->first();