app/Http/Controllers/EstructuraController.php

    public function index()
    {
        return response()->json(Estructura::orderBy('id', 'desc')->get());
---
select * from "estructuras" order by "id" desc