app/Http/Controllers/MantenimientoController.php

    public function index()
    {
        $mantenimientos = Mantenimiento::orderBy('id', 'desc')->get();
---
select * from "mantenimientos" order by "id" desc

    public function pdf($id)
    {
        $m = Mantenimiento::findOrFail($id);
---
select * from "mantenimientos" where "mantenimientos"."id" = '76' limit 1