app/Http/Controllers/PlanMantenimientoController.php

    public function index()
    {
        $plan = PlanMantenimiento::orderBy('anio', 'asc')
            ->orderBy('mes', 'asc')
            ->orderBy('id', 'desc')
            ->get()
            ->map(function ($item) {
                return [
                    'id' => $item->id,
                    'año' => $item->anio,
                    'mes' => $item->mes,
                    'placa' => $item->placa,
                    'tipo' => $item->tipo,
                    'ejecutado_manual' => $item->ejecutado_manual ? 1 : 0
                ];
            });
---
select * from "plan_mantenimientos" order by "anio" asc, "mes" asc, "id" desc