app/Http/Controllers/RcmController.php

    public function diagnostico()
    {
        $estructuras = Estructura::all();
        $hoy = Carbon::now();
        $haceUnAno = Carbon::now()->subYear();

        $baterias = [];
        $motoresAlerta = [];
        $reguladoresAlerta = [];
        $conteoBaterias = ['criticas' => 0, 'alerta' => 0, 'normales' => 0, 'total' => 0];

        foreach ($estructuras as $eq) {
            // Analiza el último mantenimiento registrado de cada equipo
            $ultimoMant = Mantenimiento::where('estructura', $eq->codigo)
                ->orderBy('fecha', 'desc')
                ->orderBy('id', 'desc')
                ->first();
---
select * from "estructuras"
select * from "mantenimientos" where "estructura" = 'O-SCZ-000A2' order by "fecha" desc, "id" desc limit 1